package cn.studyou.rxjavaretrofitdemo.entity;

import java.io.Serializable;
import java.util.List;

/**
 * 基本功能：接口数据实体－－健康信息
 * 创建：王杰
 * 创建时间：16/4/27
 * 邮箱：w489657152@gmail.com
 */
public class Health implements Serializable{

    /**
     * msg : success
     * result : {"list":[{"content":"　　一个健康的脊椎，不仅可以使您看上去更加挺拔，更能使您免除腰酸背痛的苦恼。以下就介绍十种方法可以使您自己拥有健康的身体进而远离病痛。 　　一、站立的时候 　　当我们站立时，脊椎承受我们所有的体重，所以站立的姿势非常重要，而正常的脊椎有一定的弧度，保持及维持正常的弧度能够减轻脊椎所承受的压力，所以可以减轻背部酸痛，当我们需要长时间站立时可以轮流将一只脚放在高度约廿至卅公分高度的脚凳上，如此就可以减轻背部所受的压力。 　　二、坐立的时候 　　白领MM的工作花大多的时间坐在椅子上，所以坐姿非常重要，坐的时候背部一定要有椅背的支撑，最好椅背能够稍有突出的弧度来支撑背部。 　　另外可以将膝盖的高度稍高于臀部的位置，如此也可以减少脊椎所受的压力。一个姿势的维持不要超过一个小时就应稍微活动一下身躯，也有助背部的健康。 　　三、拿取高处物品时 　　当要拿取置于高处物品时，记得一定要站载脚凳上以减少脊椎受伤的可能。 　　四、搬东西时 　　请记得尽量用推的，少用拉的方式。当准备要推东西的时候用您的手臂及脚来开始推的力量。 　　五、抬重物时 　　当要抬重物时，一只脚用半跪姿，另外身体尽量靠近要抬的物品，保持背部的平直，记得尽量用脚的力量来减轻背部的压力。 　　六、搬运物品时 　　携带物品时，分两小袋比一大袋来得容易，并且尽量让物品靠近身体以减轻脊椎的受力。 　　七、睡觉时 　　当躺卧时脊椎所受的压力最小，所以适度的休息也有助于背部酸痛的减轻，平躺时膝盖下放个枕头或是侧躺时两脚中夹个枕头都有助于脊椎压力的减轻。 　　八、控制体重 　　请记住您的脊椎承受着您的全身重量。要减轻您脊椎受力的一个好方法，就是维持您的标准体重，试想您自己背负一个五十公斤的沙袋和背负一百公斤沙袋时的情形，然后再想您要您的脊椎背负多少公斤的沙袋?理想的状况试不要超过您的标准体重五公斤以上可以让你更健康。 　　九、戒烟 　　根据统计抽烟的人比不抽烟的人，背部酸痛的情形高出二至三倍，因为香烟中的尼古丁会使得微血管收缩进而使得营养脊椎的养分减少，脊椎椎间板功能逐渐退化而造成酸痛的情形。 　　十、轻微的背痛 　　当有轻微的背痛时就是一种警告讯号，必须要加以重视，请专业的医生处理以免问题变大。 　　现代人的生活不仅是要求活的久，更要活的有生活品质。一个健康的背部，不仅可以使得活动自如、身轻如燕，更可使您的心肺功能因有足够运动而不致退化。另外当您真的有背部酸痛的情形，也不要轻忽及早找专业人员帮您解决问题，使您更健康有活力。","id":29291,"title":"办公族健康脊椎保健十大妙招。。。"},{"content":"　　通过下面一些简单的检查对照，看看你的脊椎是否健康。 　　1.脚后跟常被磨得高低不平，通常是由于双腿长度不平等或沿着脊柱长轴压力的不均衡造成的。 　　2.不能完成舒适的深、长呼吸。 　　3.下颌运动时会发出\u201c卡嗒\u201d的声音。多是由于颈部或者髋关节半脱位引起的。 　　4.颈部、背部或更多关节会发出爆裂的声音。通常是由于脊椎关节被锁住或卡住。 　　5.头或髋部不能向两侧轻松地扭动或者旋转相同的角度，运动的范围正逐渐缩小。 　　6.经常感到疲劳，因为不平衡的脊柱会消耗你的能量。 　　7.精神不能很好集中。因为脊椎半脱位会影响大脑健康。 　　8.对疾病的抵抗力较弱。脊椎半脱位可以影响你的神经内分泌系统，而神经内分泌系统在抵抗疾病和防止传染方面很重要。 　　9.行走时，脚尖会向外展开。只要你不有意改变的话，这种检测实验很容易完成。走路时注意看脚，它们两者都指向前方吗？或者有一侧脚已向内或向外展开？脚外展也许是下部脊椎或髋骨的问题，或是头颈部、颅骨基底部压力不均衡的信号。 　　10.出现一条腿比另一条腿短。不脱鞋，躺下，让一个人在你脚边站着，把你的脚后跟沿着身体的方向轻轻拉直，观察你的脚，比脚后跟的位置，一侧腿（通常是右侧）会比另一侧短0.32～0.254厘米。 　　11.有不良姿态。两脚分开，与肩同宽战立，体重应该相等地分配在两个脚掌。否则就是你的脊椎或头、臀部不在身体中心线上。 　　12.有头痛或颈、腰、背部的疼痛及肌肉或关节的软组织疼痛。通常是具有脊椎半脱位的信号。 　　13.身体有一种持续的紧张皱缩感和压力感，尤其是在肌肉和关节中有发紧的感觉。 　　14.感到背和颈僵硬不适。僵硬不适也许是脊椎半脱位的信号。 　　15.只是感到轻微的不舒服，但你的健康状况并不，脊椎半脱位也能影响你的全面健康。","id":12702,"title":"脊椎不健康的15种表现"},{"content":"　　如今的办公室OL们长期保持同一姿势工作，下班后，脖子疼腰疼的情况一定时有发生。很多人会寻求推拿按摩消除疼痛，殊不知这类疼痛来自于积劳成疾的脊椎，单纯的止痛不但不能从根本上取得效果，还掩盖了脊椎问题来袭的小信号。 　　据权威机构统计，近年来，脊椎病患者日渐年轻化，中青年群体成为易患脊椎病的高危人群。在白领人群中有75%的人患有不同程度的颈椎病，而司机人群中也有55%以上饱受腰椎问题的折磨！ 　　哪些信号会告诉你脊椎出了问题 　　脊椎疾病初期，常有一段反复落枕、颈背腰系列综合症状出现，常伴随头晕、偏头痛、脖子疼、腰酸、肩膀僵硬、手臂乏力等症状。 　　这是因为长时间身体僵直，前屈，脊椎附近肌肉、韧带、筋膜、关节囊等软组织时刻处于紧张状态，颈部、背部、腰部的肌肉受到疲劳之后超出生理的负荷，产生无菌性的炎症，就会在肌肉筋膜里面产生水肿，疼痛的因子就会来刺激神经的末梢产生疼痛，久而久之成为顽疾。 　　很多人都认为脊椎相关疾病危害不大，没有给予足够的重视，殊不知此类病症会导致颈部、背部、腰部的疼痛，长短腿和脊柱侧弯。 　　由于脊柱联络了整个身体的中枢神经，严重的脊椎病患者会出现四肢严重乏力，甚至会瘫痪，生活不能自理。 　　从生活的细节上预防脊椎病 　　1.站着打电话 　　久坐的白领可以在打电话或接电话时站起来，双脚轮流支撑身体、转换重心，这样有利于促进血液循环，消耗更多热量。 　　2.办公室放健身球 　　美国谷歌公司和德国宝马公司都允许员工把健身球当椅子。坐这种球时，身体需要不停地动以保持平衡，能避免久坐不动带来的危害。 　　3.桌下伸伸腿 　　坐时在桌下绷绷脚尖、伸展足背，或者双腿并拢抬一小会儿，伸展下肢对预防静脉血栓最有用。 　　职业决定久坐的人群，下肢循环不畅，应该常做这样的抬腿运动。 　　4.椅上放坐垫 　　作为白领和司机，座位上放坐垫能够缓解久坐带来的腰疼和尾骨疼，重量均匀分布后，还能减少椅子对坐骨结节的摩擦。 　　也可在脚下也放个厚垫子，让双腿适度抬高。 　　5.选择一个好枕头 　　不要枕太高太软或太硬的枕头。选择可以有效保持颈椎最佳弧度，能帮助身体迅速放松，无论侧卧或仰卧，对颈椎乃至整个脊柱都有好处的枕头。其实，我们历史悠久的荞麦皮枕头就很不错。 　　6.善用热敷 　　脖子疼或者腰疼时，用毛巾热敷能缓解疼痛。对于颈椎有损伤后的习惯性落枕，亦有很好的效果。","id":20862,"title":"6个生活细节教你预防脊椎病。。。"},{"content":"　　专家支招教你在旅途中保护好腰椎、颈椎等重要部位。 　　春节到来，归心似箭的返乡一族正陆续踏上回家的路；计划潇洒出游的朋友们也正兴奋地期待着出发的一刻。虽然团圆和美景都很让人期待，但一路上的舟车劳顿也是免不了的。 　　无论返乡和出游选择什么交通工具，往往在到达目的地时，很多人早已腰酸背痛、疲惫不堪。如何在返乡和出游路上呵护好自己的腰椎、颈椎等重要部位？ 　　坐火车：多伸懒腰拉伸脊椎 　　久坐之后感觉腰酸、腰痛，是许多人都有过的经历。这是因为人坐久时，腰部肌肉长时间处于紧张状态，致使肌肉劳损引起酸痛不适。 　　无论采取什么坐姿，都应该在坐一段时间后，站起来活动一下腰部、下肢及全身。这不仅有利于保持腰椎的生理功能，对身体其他部位也有保护作用，建议乘客，久坐时不妨经常直直腰杆，将两肩往后扩展一下，进行所谓的\u201c伸懒腰\u201d动作，使脊椎得到充分拉伸。 　　乘飞机：带个充气靠枕护颈椎 　　相对火车而言，乘飞机可以大大缩短旅途的时间。可是就在一两个小时的飞行中，同样可能因为不慎而伤及颈椎。由于飞机上的活动空间比火车上小得多，很多乘客都会选择在飞行中靠着坐椅打个小盹。 　　人在打瞌睡时，颈椎肌肉松弛，这个时候颈椎失去肌肉的保护变得很脆弱，非常容易受伤。建议乘客，不妨带一个充气靠枕上飞机，在打瞌睡时把自己的脖子保护起来。 　　自驾车：调好坐椅，垫上腰垫 　　春节期间不少市民选择自驾车出游。为了最大程度地保护脊椎健康，建议驾驶者，连续开车最好不要超过一个小时。如果要长时间连续开车，最好中途找个地方休息几分钟，下车稍微活动一下，做一些腰部的保健操。 　　调好驾驶坐椅对保护脊椎也很重要，建议驾驶者把坐椅适当移向方向盘，使方向盘在不影响转向的情况下尽量靠近胸前。此外，还要调整座位与方向盘之间的高度，座位过低双肩会有上耸的感觉，过高则易使腰椎过度拉伸，增加腰部负荷，诱发腰椎间盘突出症。开车时在腰部和脖子后方分别塞一个合适的靠垫和靠枕，也能在急刹车时起到保护作用。 　　女性出游：换下高跟鞋、紧胸罩 　　很多女性都希望在出游时打扮得漂亮一些，脚蹬高跟鞋逛公园、叹美景的女性不在少数。提醒爱美的女性，穿高跟鞋很容易使人的腰背肌过度收缩，从而导致腰痛的发生。 　　长时间配戴过紧的胸罩，同样可能引起腰酸背痛，严重的还可能导致颈椎病。建议女性进行长途旅行时换一副较为宽松的胸罩。 　　小贴士：减轻疼痛 试试热敷 　　如果已经出现了腰酸背痛的症状，有什么简单可行的方法能缓解不适呢？热敷、温水沐浴等温热疗法能改善局部的血液循环，对痉挛的肌肉有松弛作用，能减轻疼痛，加速组织恢复，是最适合在家庭和旅馆中使用的最简单、有效的方法。 　　具体做法是：将热毛巾拧到不滴水的程度，敷在疼痛的部位，敷的面积要比疼痛部位大；也可将热水袋灌入热水，包上毛巾，放在疼痛部位，可以保持较长时间的温度；或用温度高于正常体温 　　4~5的温水淋浴10~15分钟，也能促进血液循环。","id":11922,"title":"返乡别忘呵护脊椎 自驾车调好坐椅垫上腰垫"}],"page":1,"total":4}
     * retCode : 200
     */

    private String msg;
    /**
     * list : [{"content":"　　一个健康的脊椎，不仅可以使您看上去更加挺拔，更能使您免除腰酸背痛的苦恼。以下就介绍十种方法可以使您自己拥有健康的身体进而远离病痛。 　　一、站立的时候 　　当我们站立时，脊椎承受我们所有的体重，所以站立的姿势非常重要，而正常的脊椎有一定的弧度，保持及维持正常的弧度能够减轻脊椎所承受的压力，所以可以减轻背部酸痛，当我们需要长时间站立时可以轮流将一只脚放在高度约廿至卅公分高度的脚凳上，如此就可以减轻背部所受的压力。 　　二、坐立的时候 　　白领MM的工作花大多的时间坐在椅子上，所以坐姿非常重要，坐的时候背部一定要有椅背的支撑，最好椅背能够稍有突出的弧度来支撑背部。 　　另外可以将膝盖的高度稍高于臀部的位置，如此也可以减少脊椎所受的压力。一个姿势的维持不要超过一个小时就应稍微活动一下身躯，也有助背部的健康。 　　三、拿取高处物品时 　　当要拿取置于高处物品时，记得一定要站载脚凳上以减少脊椎受伤的可能。 　　四、搬东西时 　　请记得尽量用推的，少用拉的方式。当准备要推东西的时候用您的手臂及脚来开始推的力量。 　　五、抬重物时 　　当要抬重物时，一只脚用半跪姿，另外身体尽量靠近要抬的物品，保持背部的平直，记得尽量用脚的力量来减轻背部的压力。 　　六、搬运物品时 　　携带物品时，分两小袋比一大袋来得容易，并且尽量让物品靠近身体以减轻脊椎的受力。 　　七、睡觉时 　　当躺卧时脊椎所受的压力最小，所以适度的休息也有助于背部酸痛的减轻，平躺时膝盖下放个枕头或是侧躺时两脚中夹个枕头都有助于脊椎压力的减轻。 　　八、控制体重 　　请记住您的脊椎承受着您的全身重量。要减轻您脊椎受力的一个好方法，就是维持您的标准体重，试想您自己背负一个五十公斤的沙袋和背负一百公斤沙袋时的情形，然后再想您要您的脊椎背负多少公斤的沙袋?理想的状况试不要超过您的标准体重五公斤以上可以让你更健康。 　　九、戒烟 　　根据统计抽烟的人比不抽烟的人，背部酸痛的情形高出二至三倍，因为香烟中的尼古丁会使得微血管收缩进而使得营养脊椎的养分减少，脊椎椎间板功能逐渐退化而造成酸痛的情形。 　　十、轻微的背痛 　　当有轻微的背痛时就是一种警告讯号，必须要加以重视，请专业的医生处理以免问题变大。 　　现代人的生活不仅是要求活的久，更要活的有生活品质。一个健康的背部，不仅可以使得活动自如、身轻如燕，更可使您的心肺功能因有足够运动而不致退化。另外当您真的有背部酸痛的情形，也不要轻忽及早找专业人员帮您解决问题，使您更健康有活力。","id":29291,"title":"办公族健康脊椎保健十大妙招。。。"},{"content":"　　通过下面一些简单的检查对照，看看你的脊椎是否健康。 　　1.脚后跟常被磨得高低不平，通常是由于双腿长度不平等或沿着脊柱长轴压力的不均衡造成的。 　　2.不能完成舒适的深、长呼吸。 　　3.下颌运动时会发出\u201c卡嗒\u201d的声音。多是由于颈部或者髋关节半脱位引起的。 　　4.颈部、背部或更多关节会发出爆裂的声音。通常是由于脊椎关节被锁住或卡住。 　　5.头或髋部不能向两侧轻松地扭动或者旋转相同的角度，运动的范围正逐渐缩小。 　　6.经常感到疲劳，因为不平衡的脊柱会消耗你的能量。 　　7.精神不能很好集中。因为脊椎半脱位会影响大脑健康。 　　8.对疾病的抵抗力较弱。脊椎半脱位可以影响你的神经内分泌系统，而神经内分泌系统在抵抗疾病和防止传染方面很重要。 　　9.行走时，脚尖会向外展开。只要你不有意改变的话，这种检测实验很容易完成。走路时注意看脚，它们两者都指向前方吗？或者有一侧脚已向内或向外展开？脚外展也许是下部脊椎或髋骨的问题，或是头颈部、颅骨基底部压力不均衡的信号。 　　10.出现一条腿比另一条腿短。不脱鞋，躺下，让一个人在你脚边站着，把你的脚后跟沿着身体的方向轻轻拉直，观察你的脚，比脚后跟的位置，一侧腿（通常是右侧）会比另一侧短0.32～0.254厘米。 　　11.有不良姿态。两脚分开，与肩同宽战立，体重应该相等地分配在两个脚掌。否则就是你的脊椎或头、臀部不在身体中心线上。 　　12.有头痛或颈、腰、背部的疼痛及肌肉或关节的软组织疼痛。通常是具有脊椎半脱位的信号。 　　13.身体有一种持续的紧张皱缩感和压力感，尤其是在肌肉和关节中有发紧的感觉。 　　14.感到背和颈僵硬不适。僵硬不适也许是脊椎半脱位的信号。 　　15.只是感到轻微的不舒服，但你的健康状况并不，脊椎半脱位也能影响你的全面健康。","id":12702,"title":"脊椎不健康的15种表现"},{"content":"　　如今的办公室OL们长期保持同一姿势工作，下班后，脖子疼腰疼的情况一定时有发生。很多人会寻求推拿按摩消除疼痛，殊不知这类疼痛来自于积劳成疾的脊椎，单纯的止痛不但不能从根本上取得效果，还掩盖了脊椎问题来袭的小信号。 　　据权威机构统计，近年来，脊椎病患者日渐年轻化，中青年群体成为易患脊椎病的高危人群。在白领人群中有75%的人患有不同程度的颈椎病，而司机人群中也有55%以上饱受腰椎问题的折磨！ 　　哪些信号会告诉你脊椎出了问题 　　脊椎疾病初期，常有一段反复落枕、颈背腰系列综合症状出现，常伴随头晕、偏头痛、脖子疼、腰酸、肩膀僵硬、手臂乏力等症状。 　　这是因为长时间身体僵直，前屈，脊椎附近肌肉、韧带、筋膜、关节囊等软组织时刻处于紧张状态，颈部、背部、腰部的肌肉受到疲劳之后超出生理的负荷，产生无菌性的炎症，就会在肌肉筋膜里面产生水肿，疼痛的因子就会来刺激神经的末梢产生疼痛，久而久之成为顽疾。 　　很多人都认为脊椎相关疾病危害不大，没有给予足够的重视，殊不知此类病症会导致颈部、背部、腰部的疼痛，长短腿和脊柱侧弯。 　　由于脊柱联络了整个身体的中枢神经，严重的脊椎病患者会出现四肢严重乏力，甚至会瘫痪，生活不能自理。 　　从生活的细节上预防脊椎病 　　1.站着打电话 　　久坐的白领可以在打电话或接电话时站起来，双脚轮流支撑身体、转换重心，这样有利于促进血液循环，消耗更多热量。 　　2.办公室放健身球 　　美国谷歌公司和德国宝马公司都允许员工把健身球当椅子。坐这种球时，身体需要不停地动以保持平衡，能避免久坐不动带来的危害。 　　3.桌下伸伸腿 　　坐时在桌下绷绷脚尖、伸展足背，或者双腿并拢抬一小会儿，伸展下肢对预防静脉血栓最有用。 　　职业决定久坐的人群，下肢循环不畅，应该常做这样的抬腿运动。 　　4.椅上放坐垫 　　作为白领和司机，座位上放坐垫能够缓解久坐带来的腰疼和尾骨疼，重量均匀分布后，还能减少椅子对坐骨结节的摩擦。 　　也可在脚下也放个厚垫子，让双腿适度抬高。 　　5.选择一个好枕头 　　不要枕太高太软或太硬的枕头。选择可以有效保持颈椎最佳弧度，能帮助身体迅速放松，无论侧卧或仰卧，对颈椎乃至整个脊柱都有好处的枕头。其实，我们历史悠久的荞麦皮枕头就很不错。 　　6.善用热敷 　　脖子疼或者腰疼时，用毛巾热敷能缓解疼痛。对于颈椎有损伤后的习惯性落枕，亦有很好的效果。","id":20862,"title":"6个生活细节教你预防脊椎病。。。"},{"content":"　　专家支招教你在旅途中保护好腰椎、颈椎等重要部位。 　　春节到来，归心似箭的返乡一族正陆续踏上回家的路；计划潇洒出游的朋友们也正兴奋地期待着出发的一刻。虽然团圆和美景都很让人期待，但一路上的舟车劳顿也是免不了的。 　　无论返乡和出游选择什么交通工具，往往在到达目的地时，很多人早已腰酸背痛、疲惫不堪。如何在返乡和出游路上呵护好自己的腰椎、颈椎等重要部位？ 　　坐火车：多伸懒腰拉伸脊椎 　　久坐之后感觉腰酸、腰痛，是许多人都有过的经历。这是因为人坐久时，腰部肌肉长时间处于紧张状态，致使肌肉劳损引起酸痛不适。 　　无论采取什么坐姿，都应该在坐一段时间后，站起来活动一下腰部、下肢及全身。这不仅有利于保持腰椎的生理功能，对身体其他部位也有保护作用，建议乘客，久坐时不妨经常直直腰杆，将两肩往后扩展一下，进行所谓的\u201c伸懒腰\u201d动作，使脊椎得到充分拉伸。 　　乘飞机：带个充气靠枕护颈椎 　　相对火车而言，乘飞机可以大大缩短旅途的时间。可是就在一两个小时的飞行中，同样可能因为不慎而伤及颈椎。由于飞机上的活动空间比火车上小得多，很多乘客都会选择在飞行中靠着坐椅打个小盹。 　　人在打瞌睡时，颈椎肌肉松弛，这个时候颈椎失去肌肉的保护变得很脆弱，非常容易受伤。建议乘客，不妨带一个充气靠枕上飞机，在打瞌睡时把自己的脖子保护起来。 　　自驾车：调好坐椅，垫上腰垫 　　春节期间不少市民选择自驾车出游。为了最大程度地保护脊椎健康，建议驾驶者，连续开车最好不要超过一个小时。如果要长时间连续开车，最好中途找个地方休息几分钟，下车稍微活动一下，做一些腰部的保健操。 　　调好驾驶坐椅对保护脊椎也很重要，建议驾驶者把坐椅适当移向方向盘，使方向盘在不影响转向的情况下尽量靠近胸前。此外，还要调整座位与方向盘之间的高度，座位过低双肩会有上耸的感觉，过高则易使腰椎过度拉伸，增加腰部负荷，诱发腰椎间盘突出症。开车时在腰部和脖子后方分别塞一个合适的靠垫和靠枕，也能在急刹车时起到保护作用。 　　女性出游：换下高跟鞋、紧胸罩 　　很多女性都希望在出游时打扮得漂亮一些，脚蹬高跟鞋逛公园、叹美景的女性不在少数。提醒爱美的女性，穿高跟鞋很容易使人的腰背肌过度收缩，从而导致腰痛的发生。 　　长时间配戴过紧的胸罩，同样可能引起腰酸背痛，严重的还可能导致颈椎病。建议女性进行长途旅行时换一副较为宽松的胸罩。 　　小贴士：减轻疼痛 试试热敷 　　如果已经出现了腰酸背痛的症状，有什么简单可行的方法能缓解不适呢？热敷、温水沐浴等温热疗法能改善局部的血液循环，对痉挛的肌肉有松弛作用，能减轻疼痛，加速组织恢复，是最适合在家庭和旅馆中使用的最简单、有效的方法。 　　具体做法是：将热毛巾拧到不滴水的程度，敷在疼痛的部位，敷的面积要比疼痛部位大；也可将热水袋灌入热水，包上毛巾，放在疼痛部位，可以保持较长时间的温度；或用温度高于正常体温 　　4~5的温水淋浴10~15分钟，也能促进血液循环。","id":11922,"title":"返乡别忘呵护脊椎 自驾车调好坐椅垫上腰垫"}]
     * page : 1
     * total : 4
     */

    private ResultEntity result;
    private String retCode;

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public ResultEntity getResult() {
        return result;
    }

    public void setResult(ResultEntity result) {
        this.result = result;
    }

    public String getRetCode() {
        return retCode;
    }

    public void setRetCode(String retCode) {
        this.retCode = retCode;
    }

    public static class ResultEntity implements Serializable{
        private int page;
        private int total;
        /**
         * content : 　　一个健康的脊椎，不仅可以使您看上去更加挺拔，更能使您免除腰酸背痛的苦恼。以下就介绍十种方法可以使您自己拥有健康的身体进而远离病痛。 　　一、站立的时候 　　当我们站立时，脊椎承受我们所有的体重，所以站立的姿势非常重要，而正常的脊椎有一定的弧度，保持及维持正常的弧度能够减轻脊椎所承受的压力，所以可以减轻背部酸痛，当我们需要长时间站立时可以轮流将一只脚放在高度约廿至卅公分高度的脚凳上，如此就可以减轻背部所受的压力。 　　二、坐立的时候 　　白领MM的工作花大多的时间坐在椅子上，所以坐姿非常重要，坐的时候背部一定要有椅背的支撑，最好椅背能够稍有突出的弧度来支撑背部。 　　另外可以将膝盖的高度稍高于臀部的位置，如此也可以减少脊椎所受的压力。一个姿势的维持不要超过一个小时就应稍微活动一下身躯，也有助背部的健康。 　　三、拿取高处物品时 　　当要拿取置于高处物品时，记得一定要站载脚凳上以减少脊椎受伤的可能。 　　四、搬东西时 　　请记得尽量用推的，少用拉的方式。当准备要推东西的时候用您的手臂及脚来开始推的力量。 　　五、抬重物时 　　当要抬重物时，一只脚用半跪姿，另外身体尽量靠近要抬的物品，保持背部的平直，记得尽量用脚的力量来减轻背部的压力。 　　六、搬运物品时 　　携带物品时，分两小袋比一大袋来得容易，并且尽量让物品靠近身体以减轻脊椎的受力。 　　七、睡觉时 　　当躺卧时脊椎所受的压力最小，所以适度的休息也有助于背部酸痛的减轻，平躺时膝盖下放个枕头或是侧躺时两脚中夹个枕头都有助于脊椎压力的减轻。 　　八、控制体重 　　请记住您的脊椎承受着您的全身重量。要减轻您脊椎受力的一个好方法，就是维持您的标准体重，试想您自己背负一个五十公斤的沙袋和背负一百公斤沙袋时的情形，然后再想您要您的脊椎背负多少公斤的沙袋?理想的状况试不要超过您的标准体重五公斤以上可以让你更健康。 　　九、戒烟 　　根据统计抽烟的人比不抽烟的人，背部酸痛的情形高出二至三倍，因为香烟中的尼古丁会使得微血管收缩进而使得营养脊椎的养分减少，脊椎椎间板功能逐渐退化而造成酸痛的情形。 　　十、轻微的背痛 　　当有轻微的背痛时就是一种警告讯号，必须要加以重视，请专业的医生处理以免问题变大。 　　现代人的生活不仅是要求活的久，更要活的有生活品质。一个健康的背部，不仅可以使得活动自如、身轻如燕，更可使您的心肺功能因有足够运动而不致退化。另外当您真的有背部酸痛的情形，也不要轻忽及早找专业人员帮您解决问题，使您更健康有活力。
         * id : 29291
         * title : 办公族健康脊椎保健十大妙招。。。
         */

        private List<ListEntity> list;

        public int getPage() {
            return page;
        }

        public void setPage(int page) {
            this.page = page;
        }

        public int getTotal() {
            return total;
        }

        public void setTotal(int total) {
            this.total = total;
        }

        public List<ListEntity> getList() {
            return list;
        }

        public void setList(List<ListEntity> list) {
            this.list = list;
        }

        public static class ListEntity implements Serializable{
            private String content;
            private int id;
            private String title;

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public String getTitle() {
                return title;
            }

            public void setTitle(String title) {
                this.title = title;
            }

            @Override
            public String toString() {
                return "ListEntity{" +
                        "content='" + content + '\'' +
                        ", id=" + id +
                        ", title='" + title + '\'' +
                        '}';
            }
        }

        @Override
        public String toString() {
            return "ResultEntity{" +
                    "page=" + page +
                    ", total=" + total +
                    ", list=" + list +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "Health{" +
                "msg='" + msg + '\'' +
                ", result=" + result +
                ", retCode='" + retCode + '\'' +
                '}';
    }
}
